1) date formats 2) naming conventions 3) typo

In [88]:
import pandas as pd
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['John Doe', 'Jonh Doe', 'Jane Doe', 'Jane Doe'],
    'sales_2020': [100, 200, 100, 200],
    'sales_2021': [None, 400, 300, 150]
}
#make pandas dataframe 
df = pd.DataFrame(data)
df.head()

         date        country      name  sales_2020  sales_2021
0  2021-12-01            USA  John Doe         100         NaN
1  01-12-2022         U.S.A.  Jonh Doe         200       400.0
2  2022/12/01        America  Jane Doe         100       300.0
3  12-01-2021  United States  Jane Doe         200       150.0

In [11]:
df['date'] = pd.to_datetime(df['date'] , errors ='coerce')
df['date'] = df['date'].dt.strftime("%d/%m/%Y")
df.head()

         date        country      name  sales_2020  sales_2021
0  01/12/2021            USA  John Doe       100.0         NaN
1         NaN         U.S.A.  Jonh Doe       200.0       150.0
2         NaN        America  Jane Doe         NaN       300.0
3         NaN  United States  Jane Doe       200.0       150.0

In [69]:

def standardize(single_date):
    types = ["%Y-%m-%d","%d-%m-%Y" ,"%Y/%m/%d" ,"%m-%d-%Y" ]
    for fmt in types :
        try:   
            return pd.to_datetime(single_date, format = fmt , errors='coerce').strftime("%d-%m-%Y")    
        except:
            continue
    return None

df['date'] = df['date'].apply(standardize)
df.head()

         date        country      name  sales_2020  sales_2021
0  01-12-2021            USA  John Doe       100.0         NaN
1  01-12-2022         U.S.A.  Jonh Doe       200.0       150.0
2  01-12-2022        America  Jane Doe         NaN       300.0
3  12-01-2021  United States  Jane Doe       200.0       150.0

Fixing Naming Conventions

In [70]:
country_map = {
    'USA': 'United States',
    'U.S.A.':'United States',
    'America':'United States',
}
df['country'] = df['country'].replace(country_map)
df.head()

         date        country      name  sales_2020  sales_2021
0  01-12-2021  United States  John Doe       100.0         NaN
1  01-12-2022  United States  Jonh Doe       200.0       150.0
2  01-12-2022  United States  Jane Doe         NaN       300.0
3  12-01-2021  United States  Jane Doe       200.0       150.0

Fixing the Typo

In [71]:
name_map={
    'Jonh Doe' :'John Doe',
}
df['name'] = df['name'].replace(name_map)
df.head()

         date        country      name  sales_2020  sales_2021
0  01-12-2021  United States  John Doe       100.0         NaN
1  01-12-2022  United States  John Doe       200.0       150.0
2  01-12-2022  United States  Jane Doe         NaN       300.0
3  12-01-2021  United States  Jane Doe       200.0       150.0

Dropping the duplicates

In [67]:
df = df.drop_duplicates(subset ='name')
df.head()

         date        country      name  sales_2020  sales_2021
0  01-12-2021  United States  John Doe       100.0         NaN
2  01-12-2022  United States  Jane Doe         NaN       300.0

Fixing contradictory logic ( 2021 sales should be greate than 2020)

In [92]:

df=df.drop(df[df['sales_2021']<=df['sales_2020']].index)

In [94]:
df.head()

         date  country      name  sales_2020  sales_2021
0  2021-12-01      USA  John Doe         100         NaN
1  01-12-2022   U.S.A.  Jonh Doe         200       400.0
2  2022/12/01  America  Jane Doe         100       300.0